In [1]:
import pandas as pd

In [2]:
data = [(1,2,3,4),(5,6,7,8),(9,10,11,12),(13,14,15,16)]
c = 'c1 c2 c3 c4'.split()
l = 'l1 l2 l3 l4'.split()

In [10]:
df = pd.DataFrame(data, columns=c, index=l)
df.columns.name = ''
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [11]:
df[['c2','c1','c3']]

    c2  c1  c3
l1   2   1   3
l2   6   5   7
l3  10   9  11
l4  14  13  15

In [51]:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [24]:
df[:][1:][2:][['c2','c4']]

    c2  c4
l4  14  16

In [25]:
df[1:3][['c1','c2']]
#Selecionando linas e colunas desejadas

    c1  c2
l2   5   6
l3   9  10

In [31]:
df.loc[['l3','l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [33]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [32]:
df.loc['l2','c1']

5

In [44]:
df.loc[['l4','l3']]

    c1  c2  c3  c4
l4  13  14  15  16
l3   9  10  11  12

In [52]:
df.iloc[:,1]

l1     2
l2     6
l3    10
l4    14
Name: c2, dtype: int64

In [53]:
df.loc[['l2','l4'],['c2','c3','c1']]

    c2  c3  c1
l2   6   7   5
l4  14  15  13

In [54]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [55]:
df.iloc[[1,3],[1,2,0]]

    c2  c3  c1
l2   6   7   5
l4  14  15  13

In [68]:
df[1:2][['c2','c3']]

    c2  c3
l2   6   7

In [ ]:
# df.loc[linha,coluna]